{
  "schools": [
    {
      "id": "seecs",
      "name": "SEECS",
      "image": "/gallery/seecs.jpg",
      "content": "School of Electrical Engineering and Computer Science (SEECS), formerly known as NUST Institute of Information Technology (NIIT), offers undergraduate, postgraduate, doctorate as well as certificate level programs in all domains of the fields of Computers and Technology. Currently offering bachelor degrees in Computer Science, Software and Electrical Engineering, SEECS lauds itself on the state-of-the-art teaching and training technologies as well as a diverse faculty with degrees from leading national and international universities. SEECS also prides itself in its multiple research labs, working on national and international projects in the domains of Machine Learning, Data Science, and more. Home to one of the two supercomputers in NUST H-12, SEECS consists of 3 departments, the Department of Computing, the Department of Electrical Engineering, and the Department of Humanities and Sciences. NUST Chapter of IEEE is also based in SEECS. Home to the famous dome and glass bridge, SEECS boasts of the biggest school in NUST H-12, encompassing 3 different schools, RIMMS and IAEC. SEECS also has traditional yearly events like SEECS Got Talent and Sports Gala, held shortly after the start of the new academic year."
    },
    {
      "id": "smme",
      "name": "SMME",
      "image": "/gallery/smme.jpg",
      "content": "School of Mechanical and Manufacturing Engineering (SMME), established in 2007, offers graduate and postgraduate degrees in the fields of Mechanical Engineering, Design and Manufacturing Engineering, Robotics and Intelligence Systems, and Biomedical Sciences. The school boasts of 4 departments awarding degrees in the domains of Mechanical Engineering, Design and Manufacturing, Robotics and Artificial Intelligence, and Biomedical Engineering and Sciences. The student body of 1000 students is being taught and trained by a highly educated and talented faculty of 50 teachers, with degrees and training from reputed universities of the world. The school offers a modern industrial and academic environment to the students and faculty through its multiple labs equipped with all instruments needed for the effective training of its students. SMME prides itself in the multiple societies and NUST chapters of international institutes like IET with base in this school. SMME is also famous for its sports clubs, particularly football. The famous cafeteria of SMME, Concordia 4, is also greatly loved due to its rustic feel and attracts students from all over NUST."
    },
    {
      "id": "nice",
      "name": "NICE",
      "image": "/gallery/nice.jpg",
      "content": "NUST Institute of Civil Engineering (NICE) is a constituent institute of the four institutes of NUST School of Civil and Environmental Engineering (SCEE). It encompasses departments for major fields in Civil Engineering, namely: Structural, Geotechnical, Transportation, and Water Resources Engineering. A relatively newer school, established in 2008, NICE is ranked amongst the best Civil Engineering institutes in the country. NICE offers a bachelor in Civil Engineering program to serve the infrastructure needs of the country in the best way possible. The institute is designed and developed along modern lines which are tailored to impart and strengthen the students' knowledge in Civil Engineering and its related specialties. NICE is set up with state-of-the-art labs well-equipped with all amenities needed for adequate and thorough teaching and training of students in all domains of the program. NICE graduates have a high demand upon graduation, owing to the high standard of teaching and training given to them in the 4 years of their degree. Social Life in NICE is also well balanced, with its rooftop café attracting students from all over the H-12 campus and is always bursting with activity."
    },
    {
      "id": "scme",
      "name": "SCME",
      "image": "/gallery/scme.jpg",
      "content": "School of Chemical and Materials Engineering (SCME) commenced its programs in 2006 and is currently offering undergraduate and postgraduate degree programs in the twin disciplines of Chemical Engineering and Materials Engineering, along with specializations in Nanoscience and Surface and Process Systems Engineering. Lauded for its newly constructed wing, as well as the schools' secluded location and Grid Station, SCME students enjoy a quiet and quality education and state-of-the-art amenities in their multiple research and training labs. The school also boasts of the biggest sports grounds in all of the NUST H-12 campus, with a majority of the social events of the university taking place on this very ground. Sports and social life in SCME is well-balanced, with a multitude of sports teams and short-scale school events taking place throughout the academic year."
    },
    {
      "id": "iese",
      "name": "IESE",
      "image": "/gallery/iese.png",
      "content": "Institute of Environmental Sciences and Engineering (IESE), a constituent institute of the four institutes of NUST School of Civil and Environmental Engineering (SCEE), is one of the oldest schools in NUST. Since its foundation in 1996, IESE has become one of the largest and most fully developed interdisciplinary institutions of its kind in Pakistan. The Institute provides a stimulating, innovative, and active research environment for the study of natural and human environments. IESE offers bachelor and master degrees in Environmental Engineering and Environmental Sciences, as well as doctorates in Environmental Engineering and Sciences. This school is most well-reputed in NUST as the water supply of NUST is purified and treated by students and faculty in this institute. Large-scale research projects for the reduction and disposal of plastic waste, in addition to the treatment and economic use of groundwater, are being carried out by the acclaimed and qualified faculty in collaboration with the students in the well-equipped labs. Students of this school have a high passion for a clean, green nation and the world and thus the societies for the betterment of the environment take root in this school."
    },
    {
      "id": "igis",
      "name": "IGIS",
      "image": "/gallery/igis.jpg",
      "content": "The Institute of Geographical Information Systems (IGIS), a constituent institute of the four institutes of NUST School of Civil and Environmental Engineering (SCEE), is the first of its kind higher education learning institute in Pakistan where state-of-the-art education in Spatial Sciences and Remote Sensing is delivered. Established in 2012, IGIS has modern infrastructure including classrooms, state of art laboratories, and a digital library. The institute offers a Bachelor of Engineering in Geoinformatics, as well as specializations, and doctorates in Remote Sensing and Geographical Information Systems. Besides, the degree programs, IGIS also offers short courses to private and public sector organizations across Pakistan on demand. The Institute has experienced faculty holding Ph.D. and Post-Doc degrees in various disciplines from reputed International and National Universities."
    },
    {
      "id": "s3h",
      "name": "S3H",
      "image": "/gallery/s3h.jpg",
      "content": "School of Social Sciences and Humanities (S3H), debuted in 2008, offers bachelor and specialization degrees in the domains of Public Administration, Mass Communication, Economics, Psychology, Development studies, Chinese studies, as well as the newly introduced, Law. This school is a collation of interdisciplinary education in both emerging and traditional fields of science and technology. Its programs aspire to connect an innovation-based knowledge hub with contemporary societal needs. S3H not only creates leaders and policymakers of tomorrow but is also more than capable of being called the social hub of the NUST H-12 campus. With its amazing outdoor shed always full of life with students from all over the H-12 campus, this school is also hustling and bustling with activity, be it day or night. After a year in distance learning mode, life at S3H is back in full force with lots of social events and awaiting the 2021 batch with full zeal and zest!"
    },
    {
      "id": "nbs",
      "name": "NBS",
      "image": "/gallery/nbs.jpg",
      "content": "NUST Business School (NBS) is one of the oldest schools of NUST. Established in 1999 as NUST Institute of Management Sciences (NIMS), it has flourished to become one of the best business schools in the country. Offering graduate and postgraduate programs in Business Administration and Accounting and Finance, along with specializations in Innovation & Entrepreneurship, Human Resource Management, and Logistics & Supply Chain Management, taught and trained by a faculty of majority Ph.D. holders, NBS has emerged as the fastest-growing school of business education in the country. It prides itself in its state-of-the-art teaching and learning facilities, with highly competent faculty who possess exceptional research skills along with industry experience. Known for being a prestigious school with a formal attire dress code, social life in NBS is second to none, with the school being famous for its multitude of well-acclaimed social events. Particularly known for Debating society and Literary Circle, grandeur is one word for the events and social affairs in NBS."
    },
    {
      "id": "sns",
      "name": "SNS",
      "image": "/gallery/sns.jpg",
      "content": "School of Natural Sciences (SNS), one of the oldest constituent schools of NUST, was established in 2004. Formerly known as the Centre for Advanced Mathematics and Physics (CAMP), SNS offers graduate, postgraduate, and doctorate programs in natural science subjects, namely: Physics, Chemistry, and Mathematics and has recently launched a specialization in Statistics. SNS is a young and thriving center that contributes vitally to the research output of not only NUST but also of the country. Research labs of SNS are equipped with the most revolutionary and advanced technology and the research carried out at SNS is regularly published in international journals of repute. Students of SNS enjoy best-of-line teaching amenities and technology in labs and the multitude of student societies set up in SNS."
    },
    {
      "id": "asab",
      "name": "ASAB",
      "image": "/gallery/asab.jpg",
      "content": "Atta-ur-Rahman School of Applied Biosciences (ASAB) is the home of Pakistan's largest biotech cluster. Formerly known as the NUST Centre of Virology and Immunology (NCVI), it was established in 2007, to cater to excellent research and teaching facilities in the field of virology and immunology in Pakistan. ASAB offers only two undergraduate programs: Biotechnology and Applied Biosciences. It also offers graduate programs in Healthcare and Industrial Biotechnology, and Plant and Agribusiness. The school is unique in establishing expertise across a broad range of biotechnology, thereby encouraging innovative approaches to teaching and research. The ASAB interdisciplinary research program reflected the richness and diversity of research endeavors equal to world standards. ASAB has state-of-the-art technologies employed in the labs for use and teaching by highly competent faculty and talented students. It is also home to the second supercomputer in the NUST H-12 campus, needed for fast computing and at the disposal of the faculty and student body."
    },
    {
      "id": "sada",
      "name": "SADA",
      "image": "/gallery/sada.jpg",
      "content": "School of Art, Design, and Architecture (SADA) offers bachelor's degrees in Architecture and Industrial Design. Initiated in 2010 with the introduction of Bachelor of Architecture – a professional degree program in architecture, SADA is one of the newest schools of NUST. The Bachelor of Industrial Design was introduced in 2013, after careful planning of curriculum and hiring of the most equipped faculty with high degrees from leading international universities. Students in SADA go through rigorous and steady design-based learning, therefore studio pedagogy becomes the essence of these initiatives. Students are encouraged towards independent thinking, iterative design process, and a holistic outcome. The design studio is seen as the main vehicle in developing the cognitive, conceptual, and technical skills of the students. Students of SADA go on to procuring postgraduate degrees from known art and design universities around the globe. Social and student life at SADA is full of artistic zeal, with events like Halloween and color days celebrated will full zest among the highly talented students with an innate sense of art and design."
    },
    {
      "id": "uspcase",
      "name": "USPCAS-E",
      "image": "/gallery/uspcase.jpg",
      "content": "U.S.-Pakistan Center for Advanced Studies in Energy (USPCASE), was established with the aim to focus on applied research relevant to Pakistan’s energy needs and serve as a bridge between the government, industry, academia and to undertake sustainable policy formulation. It is a partnership between the National University of Sciences and Technology (NUST), Islamabad; University of Engineering and Technology, Peshawar (UET-P); and U.S. partner Arizona State University (ASU). It was recognized as the USAID Center for Advanced Studies in April 2014 following a competitive bid. It launched its maiden MS degree program in Energy Systems Engineering in fall 2012, the only program in the country, inviting great attention. Currently the center offers 6 postgraduate and doctorate programs, namely: Energy Systems Engineering, Thermal Energy Engineering and Electrical Energy Engineering."
    }
  ],
  "lifeAtNUST": [
    {
      "id": "students-and-cafes",
      "name": "Students and Cafes",
      "image": "/gallery/c1aerial.jpg",
      "content": "In university, you take classes from 9 am to 5 pm for the first time in your life. This not only tires you but also increases your need to refuel yourself. In addition to this, long and dreary lectures can also make us hungry, just to have an excuse to get through the class. With the huge and gorgeous campus, you walk around a lot and want to spend time with friends and be social and just have a good time. The words friends and fun go hand-in-hand with food and NUST makes sure you have no fewer food options. With the 4 main cafeterias and the 4 other fancy-dhaba-style cafes, which are student-run, food options are plenty. Starting with the main cafeterias, Concordia 1 (C1) and Concordia 2 (C2). These are proper big circular structures with everything from food shops to stationery and tuck shops. Both these cafeterias offer a variety of food items ranging from sandwiches and fries to chana daal and biryani. Some of the more loved items are Samosa Chaat and Biryani from C1, Roll parathas from C2. Fries are best left to café in C2 or Margalla café, opposite SADA Parking. C1 is generally crowded with students of SADA, ASAB, NBS, and SCME whereas C2 is comparatively less crowded, with students of SEECS and other schools mostly going there. Concordia 3 (C3), right opposite to Library, and Concordia 4 (C4), in SMME, are famous for their desi breakfast and biryani and orange juice in winter. C3 is generally alive at night, with the lights on and the pretty view of the sports complex. C4 is mostly limited to students of SNS and SMME, who are closest to it and farthest from all other cafes. Another option is the NICE rooftop café, famous for its shawarmas. Coming to the student-run cafes, the two open these days are Margalla, opposite SADA parking, and Retro, near the Boy’s hostels. With the other two cafes closed, Margalla is the life of NUST, and their food is equally so. Everything on their menu, from the fries to the pizza, everything is of great taste and quality, with the cheesy pasta being a student favorite. The first semester after coming to NUST is just exploring, do not hesitate to try new things and be open to experimenting and seeing for yourself what you like, and don’t forget to make some good memories while doing so! 😊"
    },
    {
      "id": "studying-and-cafes",
      "name": "Studying and Grades",
      "image": "/gallery/exam.jpg",
      "content": "So you’ve finally made it to the number 1 university of Pakistan, after months and months of hard work and dedication. Congratulations! But what now? What kind of education system is used in university? After more than a decade of the yearly system and 4 years of Board Exams/CIEs, let me introduce you to the Semester and Relative Grading System. This shift in the system and exam grading is something many students struggle with soon after starting university. You might ask, what is the semester system? University degrees are generally of 4 years (except Bachelor of Architecture, which is of 5 years), comprising of 8-10 semesters, each semester is 16-18 weeks long. In most schools of NUST, internal examinations include multiple small 10-minute quizzes and One Hour Tests (OHTs), which take place twice in each semester. They take place in Week 6 and Week 12, with the End Semester Examinations (ESEs) taking place in the last week of the semester. For SADA, S3H, and NBS, they have mids in Week 9. In the semester system, the course is a lot and time is scarce, hence teachers teach faster than you’re previously used to. Listen attentively in class and take clear and concise notes. Try to retain as much information as you can and at the end of the week try and go over whatever you did the previous week to gear up for the next week. One very important tip is to not leave everything for the very end, as the course is generally in a decent quantity and time between exams is little to none. Ending this on the golden rule of the semester system – Study smart, not hard! Coming to the grading scheme, most schools in NUST employ Relative Grading schemes. In this, all students are graded relative to the class average. So gone are the days of scoring high and getting grades out of the total, it all depends on the class average and how well you perfume relative to the rest of the class, hence the name relative grading. But enough of studying and grades and all, remember to enjoy as contrary to popular belief, a good GPA can lend you a job but only skills can let you keep it!"
    },
    {
      "id": "societies",
      "name": "Societies",
      "image": "/gallery/societies.jpeg",
      "content": "NUST prides itself with 11 different schools offering different programs having 7000+ students enrolled. These students come from multiple backgrounds and thus to help groom them, societies have been created. At present, 35+ societies are working in NUST, with a majority being open to students of all schools. These are student-run societies and receive funding from either external sponsors or the Main Office. These societies will have stalls up and you will be shown an introductory message of all societies and their workings during Orientation and while they may seem too many in number to remember and keep count and may either excite or even overwhelm you, it is important to know what you want to do. Societies are a way of grooming yourself, your personality, and your skills, all the while making new friends and lots of good memories. Some well-known societies include NUST Community Service Club (NCSC), NUST Debating Society (NDS), NUST Trekking Club (NTC), NUST Dramatics Club (NDC), and NUST Media Club (NMC). Applications for executives generally start after a couple of weeks of the induction of the freshmen batch. There are multiple portfolios in each society and inside each portfolio, the hierarchy followed is: Executives -> Deputy Director(s) -> Director. When filling the forms, be sure to be truthful but confident and give the interview with even greater confidence. Societies are not only a way of personal and professional grooming, but also a way of networking. So be open and nice to all and make new friends! Choose whichever portfolio interests you the most and apply away!"
    },
    {
      "id": "social-events",
      "name": "Social Events",
      "image": "/gallery/events.jpg",
      "content": "NUST prides itself in having the largest university in the country, not only in campus size but in programs offered in one campus too. With such a large body of students, there exist many societies and thus many social events take place throughout the year. The range of these events starts from a small in-school seminar or movie night to a campus-wide concert and carnival. With the campus being closed and shifting to online mode for almost a year and a half, university life is back to full zeal and zest and everyone is buzzing with excitement and ideas. Multiple societies and schools arrange different types of events, with different scales and thus it is good to keep an eye open. Some common types of social events are hiking trips to any northern area. These include night stay trips too. Other events include bake sales and movie screenings, scavenger hunts, global villages, and sports galas, concerts, raves, and talks and activities. Each comes with a ticket price ranging from Rs. 100 – Rs. 2500. It is important that you go to these events and make new friends and memories. These 4 years of your life are the best years, do not lose track of your path but also do enjoy and make the most of this time!"
    }
  ]
}