{
  "schools": [
    {
      "id": "seecs",
      "name": "SEECS",
      "image": "/gallery/seecs.jpg",
      "content": "NUST makes sure each of its departments has state-of-the-art infrastructure, as indeed its students deserve the best. The highlight of the department of SEECS is the glass bridge, a translucent, contemporary piece of architecture connecting the finest department of NUST, where adept and proficient computer and electrical engineers are in the making."
    },
    {
      "id": "smme",
      "name": "SMME",
      "image": "/gallery/smme.jpg",
      "content": "In theory, theory and practice are the same. In practice, they are not. To provide the future engineers and masterminds with bigger opportunities and a taste of real-life practices, the Manufacturing Resource Centre (MRC) was established in December 2011. Consisting of Surface Treatment Labs, Electrical Labs, Bench-Fitting Labs, Wood-working Labs, Machine Labs, Wielding and Fabrication Shops, and Foundry and Forging Labs, MRC is ready to train and polish your potential to the fullest."
    },
    {
      "id": "nice",
      "name": "NICE",
      "image": "/gallery/nice.jpg",
      "content": "NUST Institute of Civil Engineering (NICE) is a constituent institute of the four institutes of NUST School of Civil and Environmental Engineering (SCEE). It encompasses departments for major fields in Civil Engineering, namely: Structural, Geotechnical, Transportation, and Water Resources Engineering. A relatively newer school, established in 2008, NICE is ranked amongst the best Civil Engineering institutes in the country. NICE offers a bachelor in Civil Engineering program to serve the infrastructure needs of the country in the best way possible. The institute is designed and developed along modern lines which are tailored to impart and strengthen the students' knowledge in Civil Engineering and its related specialties. NICE is set up with state-of-the-art labs well-equipped with all amenities needed for adequate and thorough teaching and training of students in all domains of the program. NICE graduates have a high demand upon graduation, owing to the high standard of teaching and training given to them in the 4 years of their degree. Social Life in NICE is also well balanced, with its rooftop café attracting students from all over the H-12 campus and is always bursting with activity."
    },
    {
      "id": "scme",
      "name": "SCME",
      "image": "/gallery/scme.jpg",
      "content": "While we only watched dexter mix his chemicals and create new technology on TV, the students of SCME get their very own Tech Corridors to do just that! With equipment that many only dreamed of, and chemicals only seen in movies, Tech Corridors provides its students with ample freedom and space to experiment their own chemical or mechanical research. With their own small (hopefully not evil) lab lair within their department, no wonder they can always be seen buzzing around it in their lab coats, eager to put every experiment into practice in front their very own eyes."
    },
    {
      "id": "iese",
      "name": "IESE",
      "image": "/gallery/iese.jpg",
      "content": "Institute of Environmental Sciences and Engineering (IESE), a constituent institute of the four institutes of NUST School of Civil and Environmental Engineering (SCEE), is one of the oldest schools in NUST. Since its foundation in 1996, IESE has become one of the largest and most fully developed interdisciplinary institutions of its kind in Pakistan. The Institute provides a stimulating, innovative, and active research environment for the study of natural and human environments. IESE offers bachelor and master degrees in Environmental Engineering and Environmental Sciences, as well as doctorates in Environmental Engineering and Sciences. This school is most well-reputed in NUST as the water supply of NUST is purified and treated by students and faculty in this institute. Large-scale research projects for the reduction and disposal of plastic waste, in addition to the treatment and economic use of groundwater, are being carried out by the acclaimed and qualified faculty in collaboration with the students in the well-equipped labs. Students of this school have a high passion for a clean, green nation and the world and thus the societies for the betterment of the environment take root in this school."
    },
    {
      "id": "igis",
      "name": "IGIS",
      "image": "/gallery/igis.jpg",
      "content": "The Institute of Geographical Information Systems (IGIS), a constituent institute of the four institutes of NUST School of Civil and Environmental Engineering (SCEE), is the first of its kind higher education learning institute in Pakistan where state-of-the-art education in Spatial Sciences and Remote Sensing is delivered. Established in 2012, IGIS has modern infrastructure including classrooms, state of art laboratories, and a digital library. The institute offers a Bachelor of Engineering in Geoinformatics, as well as specializations, and doctorates in Remote Sensing and Geographical Information Systems. Besides, the degree programs, IGIS also offers short courses to private and public sector organizations across Pakistan on demand. The Institute has experienced faculty holding Ph.D. and Post-Doc degrees in various disciplines from reputed International and National Universities."
    },
    {
      "id": "s3h",
      "name": "S3H",
      "image": "/gallery/s3h.jpg",
      "content": "Follow the music and you’ll end up in S3H, the house of almost all jamming sessions in NUST. Whether it is the open courtyard at the center of the department, surrounded by open corridors on all sides, or the hut sitting area right beside it that somehow is always cold in summers and hot in winters, there is sound everywhere. There’s never a silent moment to be found in this department, where the very courtyard itself acts as a stage for all the students. Nowhere will you find a more perfect balance where the lecture rooms are quiet and intense and yet the second you open the door, it’s lively and entertaining."
    },
    {
      "id": "nbs",
      "name": "NBS",
      "image": "/gallery/nbs.jpg",
      "content": "When the entrepreneurs are done crunching numbers, weighing profits and losses, and brainstorming ideas, NBS has the perfect place for them to relax, reflect and recharge. The rejuvenating and relaxing fish pond, where this time, Nemo might help you find your way, and Dory cheers you to just keep swimming!"
    },
    {
      "id": "sns",
      "name": "SNS",
      "image": "/gallery/sns.jpg",
      "content": "School of Natural Sciences (SNS), one of the oldest constituent schools of NUST, was established in 2004. Formerly known as the Centre for Advanced Mathematics and Physics (CAMP), SNS offers graduate, postgraduate, and doctorate programs in natural science subjects, namely: Physics, Chemistry, and Mathematics and has recently launched a specialization in Statistics. SNS is a young and thriving center that contributes vitally to the research output of not only NUST but also of the country. Research labs of SNS are equipped with the most revolutionary and advanced technology and the research carried out at SNS is regularly published in international journals of repute. Students of SNS enjoy best-of-line teaching amenities and technology in labs and the multitude of student societies set up in SNS."
    },
    {
      "id": "asab",
      "name": "ASAB",
      "image": "/gallery/asab.jpg",
      "content": "Remember those movies where a bunch of smart scientists would try to find cures for diseases but end up accidentally making zombies? Well, no zombies yet (at least not that we know of) but home to our mad scientists, ASAB offers multiple equipment and research facilities including Neurobiology, Human Molecular Genetics, Cancer, Plant Cell Signalling and much more. With always something new up their sleeves, the students of ASAB are at the frontiers of biotechnology itself."
    },
    {
      "id": "sada",
      "name": "SADA",
      "image": "/gallery/sada.jpg",
      "content": "Who would’ve thought that hardest thing to find in the architectural and industrial design department would be walls? A little ironic but hiding these walls are the numerous colorful jury sheets pinned on every studio wall. Or perhaps it’s the countless bulletin boards covered with product designs or the projects always on display. With prototypes in every corner, sheets on every wall and maquettes hanging from ceilings and railings, the students of SADA engulf the building itself into their designs. With ideas always in the air, and students always gathered on the stairs, there is never a dull moment here."
    },
    {
      "id": "uspcase",
      "name": "USPCAS-E",
      "image": "/gallery/uspcase.jpg",
      "content": "U.S.-Pakistan Center for Advanced Studies in Energy (USPCASE), was established with the aim to focus on applied research relevant to Pakistan’s energy needs and serve as a bridge between the government, industry, academia and to undertake sustainable policy formulation. It is a partnership between the National University of Sciences and Technology (NUST), Islamabad; University of Engineering and Technology, Peshawar (UET-P); and U.S. partner Arizona State University (ASU). It was recognized as the USAID Center for Advanced Studies in April 2014 following a competitive bid. It launched its maiden MS degree program in Energy Systems Engineering in fall 2012, the only program in the country, inviting great attention. Currently the center offers 6 postgraduate and doctorate programs, namely: Energy Systems Engineering, Thermal Energy Engineering and Electrical Energy Engineering."
    }
  ],
  "lifeAtNUST": [
    {
      "id": "vr-headsets-and-3d-printers-at-the-library",
      "name": "VR Headsets and 3D Printers at the Library",
      "image": "/gallery/library.jpg",
      "content": "Technology is in the name, and with the newly established Lincoln's Corner at NUST's immaculate Central Library, you too can explore the virtual world with cutting-edge VR Headsets, and up your creative mindset with the easily accessible 3-D Printers!"
    },
    {
      "id": "bowling-alley",
      "name": "Bowling Alley",
      "image": "/gallery/bowling.png",
      "content": "All work and no play is surely going to make life a drag. Thankfully, NUST H-12 has innumerable facilities through which one can unwind and have a fun time! One excellent example is NUST's Bowling Alley! Open to casuals and enthusiasts alike, it's a great place to relax and have a great relaxing time with like-minded individuals!"
    },
    
    {
      "id": "societies",
      "name": "Societies",
      "image": "/gallery/societies.jpeg",
      "content": "NUST prides itself with 11 different schools offering different programs having 7000+ students enrolled. These students come from multiple backgrounds and thus to help groom them, societies have been created. At present, 35+ societies are working in NUST, with a majority being open to students of all schools. These are student-run societies and receive funding from either external sponsors or the Main Office. These societies will have stalls up and you will be shown an introductory message of all societies and their workings during Orientation and while they may seem too many in number to remember and keep count and may either excite or even overwhelm you, it is important to know what you want to do. Societies are a way of grooming yourself, your personality, and your skills, all the while making new friends and lots of good memories. Some well-known societies include NUST Community Service Club (NCSC), NUST Debating Society (NDS), NUST Trekking Club (NTC), NUST Dramatics Club (NDC), and NUST Media Club (NMC). Applications for executives generally start after a couple of weeks of the induction of the freshmen batch. There are multiple portfolios in each society and inside each portfolio, the hierarchy followed is: Executives -> Deputy Director(s) -> Director. When filling the forms, be sure to be truthful but confident and give the interview with even greater confidence. Societies are not only a way of personal and professional grooming, but also a way of networking. So be open and nice to all and make new friends! Choose whichever portfolio interests you the most and apply away!"
    },
    {
      "id": "social-events",
      "name": "Social Events",
      "image": "/gallery/events.jpg",
      "content": "NUST prides itself in having the largest university in the country, not only in campus size but in programs offered in one campus too. With such a large body of students, there exist many societies and thus many social events take place throughout the year. The range of these events starts from a small in-school seminar or movie night to a campus-wide concert and carnival. With the campus being closed and shifting to online mode for almost a year and a half, university life is back to full zeal and zest and everyone is buzzing with excitement and ideas. Multiple societies and schools arrange different types of events, with different scales and thus it is good to keep an eye open. Some common types of social events are hiking trips to any northern area. These include night stay trips too. Other events include bake sales and movie screenings, scavenger hunts, global villages, and sports galas, concerts, raves, and talks and activities. Each comes with a ticket price ranging from Rs. 100 – Rs. 2500. It is important that you go to these events and make new friends and memories. These 4 years of your life are the best years, do not lose track of your path but also do enjoy and make the most of this time!"
    },
    {
      "id": "swimming-pool",
      "name": "Swimming Pool",
      "image": "/gallery/pool.jpg",
      "content": "Beating the heat has never been easier! As the most recent addition to the long list of sports facilities available at NUST, the 25 meter mega swimming pool offers a refreshing way for students to keep in shape."
    },
    {
      "id": "saddle-club",
      "name": "Saddle Club",
      "image": "/gallery/saddle.jpg",
      "content": "Horse-riding is an old tale, but NUST has made it accessible to all by pioneering Pakistan's first university-based horse-riding club! Take your Equestrian journey to new heights and foster a healthy and athletic lifestyle with NUST's Saddle Club membership!"
    },
    {
      "id": "shuttle",
      "name": "Shuttle",
      "image": "/gallery/shuttle.jpg",
      "content": "Traveling across our vast campus is no easy feat. Luckily, we have the shuttle service to thank for making this Herculean task easier. Just hop in and go wherever you want!"
    },
    {
      "id": "gym",
      "name": "Gym",
      "image": "/gallery/gym.jpg",
      "content": "Alongside nurturing your mind, NUST also empowers you to take care of your body. NUST Central Gym is a state of the art facility with modern equipment to cater to all the workout needs for both male and female students."
    },{
      "id": "students-and-cafes",
      "name": "Students and Cafes",
      "image": "/gallery/c1aerial.jpg",
      "content": "In university, you take classes from 9 am to 5 pm for the first time in your life. This not only tires you but also increases your need to refuel yourself. In addition to this, long and dreary lectures can also make us hungry, just to have an excuse to get through the class. With the huge and gorgeous campus, you walk around a lot and want to spend time with friends and be social and just have a good time. The words friends and fun go hand-in-hand with food and NUST makes sure you have no fewer food options. With the 4 main cafeterias and the 4 other fancy-dhaba-style cafes, which are student-run, food options are plenty. Starting with the main cafeterias, Concordia 1 (C1) and Concordia 2 (C2). These are proper big circular structures with everything from food shops to stationery and tuck shops. Both these cafeterias offer a variety of food items ranging from sandwiches and fries to chana daal and biryani. Some of the more loved items are Samosa Chaat and Biryani from C1, Roll parathas from C2. Fries are best left to café in C2 or Margalla café, opposite SADA Parking. C1 is generally crowded with students of SADA, ASAB, NBS, and SCME whereas C2 is comparatively less crowded, with students of SEECS and other schools mostly going there. Concordia 3 (C3), right opposite to Library, and Concordia 4 (C4), in SMME, are famous for their desi breakfast and biryani and orange juice in winter. C3 is generally alive at night, with the lights on and the pretty view of the sports complex. C4 is mostly limited to students of SNS and SMME, who are closest to it and farthest from all other cafes. Another option is the NICE rooftop café, famous for its shawarmas. Coming to the student-run cafes, the two open these days are Margalla, opposite SADA parking, and Retro, near the Boy’s hostels. With the other two cafes closed, Margalla is the life of NUST, and their food is equally so. Everything on their menu, from the fries to the pizza, everything is of great taste and quality, with the cheesy pasta being a student favorite. The first semester after coming to NUST is just exploring, do not hesitate to try new things and be open to experimenting and seeing for yourself what you like, and don’t forget to make some good memories while doing so! 😊"
    },
    {
      "id": "studying-and-cafes",
      "name": "Studying and Grades",
      "image": "/gallery/exam.jpg",
      "content": "So you’ve finally made it to the number 1 university of Pakistan, after months and months of hard work and dedication. Congratulations! But what now? What kind of education system is used in university? After more than a decade of the yearly system and 4 years of Board Exams/CIEs, let me introduce you to the Semester and Relative Grading System. This shift in the system and exam grading is something many students struggle with soon after starting university. You might ask, what is the semester system? University degrees are generally of 4 years (except Bachelor of Architecture, which is of 5 years), comprising of 8-10 semesters, each semester is 16-18 weeks long. In most schools of NUST, internal examinations include multiple small 10-minute quizzes and One Hour Tests (OHTs), which take place twice in each semester. They take place in Week 6 and Week 12, with the End Semester Examinations (ESEs) taking place in the last week of the semester. For SADA, S3H, and NBS, they have mids in Week 9. In the semester system, the course is a lot and time is scarce, hence teachers teach faster than you’re previously used to. Listen attentively in class and take clear and concise notes. Try to retain as much information as you can and at the end of the week try and go over whatever you did the previous week to gear up for the next week. One very important tip is to not leave everything for the very end, as the course is generally in a decent quantity and time between exams is little to none. Ending this on the golden rule of the semester system – Study smart, not hard! Coming to the grading scheme, most schools in NUST employ Relative Grading schemes. In this, all students are graded relative to the class average. So gone are the days of scoring high and getting grades out of the total, it all depends on the class average and how well you perfume relative to the rest of the class, hence the name relative grading. But enough of studying and grades and all, remember to enjoy as contrary to popular belief, a good GPA can lend you a job but only skills can let you keep it!"
    }
    
  ]
}