{
    "coverpage" : {
        "images":["/logo/logo2017.jpg", "/logo/logo2018.jpg", "/logo/logo2019.jpg", "/logo/logo2020.jpg", "/logo/logo2021.jpg", "/logo/logo.jpg"]
    }, 
    "history" : [
        {
            "id" : "Orientation 2017",
            "images": ["/ON/ON 17/1.jpg", "/ON/ON 17/2.jpg", "/ON/ON 17/3.jpg", "/ON/ON 17/4.jpg", "/ON/ON 17/5.jpg", "/ON/ON 17/6.jpg"],
            "content": "ON'17 is where it all began! The year everyone came together to lay the foundation for what would become the biggest event at NUST.\nThe freshmen experienced an entire week filled with fun filled activities and memorable events that defined their university experience."
        },
        {
            "id" : "Orientation 2018",
            "images": ["/ON/ON 18/1.jpg", "/ON/ON 18/2.jpg", "/ON/ON 18/3.jpg", "/ON/ON 18/4.jpg", "/ON/ON 18/5.jpg", "/ON/ON 18/6.jpg"],
            "content": "ON'18 continued the tradition set the previous year while also exceeding expectations in every way. With marvellous events such as an evening of classy Qawali performances and a riveting movie night, there could not have been any better way to honor the ON legacy."
        },
        {
            "id" : "Orientation 2019",
            "images": ["/ON/ON 19/1.jpg", "/ON/ON 19/2.jpg", "/ON/ON 19/3.jpg", "/ON/ON 19/4.jpg", "/ON/ON 19/5.jpg", "/ON/ON 19/6.jpg"],
            "content": "ON '19 was a truly special event. Being the very first edition of ON to hold a concert, the anticipation and ecstatic atmosphere in its buildup remain unmatched. Featuring NUST's very own star-studded Yashal Shahid, the crowd was full of excitement, ready to experience the very best that NUST has to offer."
        },
        {
            "id" : "Orientation 2020",
            "images": ["/ON/ON 20/1.jpg", "/ON/ON 20/2.jpg", "/ON/ON 20/3.jpg", "/ON/ON 20/4.jpg", "/ON/ON 20/5.jpg", "/ON/ON 20/6.jpg"],
            "content": "We all are familiar with the tragedy of 2020: the covid pandemic. However, even amidst the pandemic, the ON’20 team went out of their way to make sure the freshmen receive a warm welcome with online newspapers, introductions and of course the legendary online batch photo. With online discussions and icebreaking activities, ON’20 made sure to make every person feel a part of NUST while being at home. No one knew better than us on how to make the best of a situation!"
        },
        {
            "id" : "Orientation 2021",
            "images": ["/ON/ON 21/1.jpg", "/ON/ON 21/2.jpg", "/ON/ON 21/3.jpg", "/ON/ON 21/4.jpg", "/ON/ON 21/5.jpg", "/ON/ON 21/6.jpg"],
            "content": "If someone told us in the uncertainty of 2020, that ON’21 would be as massive a success as it was, we wouldn’t have believed them. From BAYAAN to Mustafa Zahid, from the carnival to the Semi Final match screening that brimmed with spirit, the social energy was at an all time high. The EC impressed us with their Resources and Operations, along with an unprecedented Media Wing. ON’21 touched our souls and the skies."
        }
    ],
    "lastpage":{
        "image" : "/logo/logo.jpg"
    }
}